class Quraansoarmanage {
static final List<String> soarList = [
  "الفاتحة",
  "البَقَرَة",
'آل عِمرَان',
"النِّسَاء",
"المَائدة",
"الأنعَام",
"الأعرَاف",

"الأنفَال",

"التوبَة",

"يُونس",

"هُود",

"يُوسُف",

"الرَّعْد",

"إبراهِيم",

"الحِجْر",

"النَّحْل",

"الإسْرَاء",

"الكهْف",

"مَريَم",

"طه",

"الأنبيَاء",

"الحَج",

"المُؤمنون",

"النُّور",

"الفُرْقان",

"الشُّعَرَاء",

"النَّمْل",

"القَصَص",

"العَنكبوت",

"الرُّوم",

"لقمَان",

"السَّجدَة",

"الأحزَاب",

"سَبَأ",

"فَاطِر",

"يس",

"الصَّافات",

"ص",

"الزُّمَر",

"غَافِر",

"فُصِّلَتْ",

"الشُّورَى",

"الزُّخْرُف",

"الدُّخان",

"الجاثِية",

"الأحقاف",

"مُحَمّد",

"الفَتْح",

"الحُجُرات",

"ق",

"الذَّاريَات",

"الطُّور",

"النَّجْم",

"القَمَر",

"الرَّحمن",

"الواقِعَة",

"الحَديد",

"المُجادَلة",

"الحَشْر",

"المُمتَحَنة",

"الصَّف",

"الجُّمُعة",

"المُنافِقُون",

"التَّغابُن",

"الطَّلاق",

"التَّحْريم",

"المُلْك",

"القَلـََم",

"الحَاقّـَة",

"المَعارِج",

"نُوح",

"الجِنّ",

"المُزَّمّـِل",

"المُدَّثــِّر",

"القِيامَة",

"الإنسان",

"المُرسَلات",

"النـَّبأ",

"النـّازِعات",

"عَبَس",

"التـَّكْوير",

"الإنفِطار",

"المُطـَفِّفين",

"الإنشِقاق",

"البُروج",

"الطّارق",

"الأعلی",

"الغاشِيَة",

"الفَجْر",

"البَـلـَد",

"الشــَّمْس",

"اللـَّيل",

"الضُّحی",

"الشَّرْح",

"التـِّين",

"العَلـَق",

"القـَدر",

"البَيِّنَة",

"الزلزَلة",

"العَادِيات",

"القارِعَة",

"التَكاثـُر",

"العَصْر",

"الهُمَزَة",

"الفِيل",

"قـُرَيْش",

"المَاعُون",

"الكَوْثَر",

"الكَافِرُون",

"النـَّصر",

"المَسَد",

"الإخْلَاص",

"الفَلَق",
"النَّاس",
];
static final List<String> AzaaList = ['الجزء الأول' , 'الجزء الثاني' , 'الجزء الثالث' , 'الجزء الرابع' , 'الجزء الخامس', 'الجزء السادس' ,'الجزء السابع' ,'الجزء الثامن' , 'الجزء التاسع' ,'الجزء العاشر' , 'الجزء الحادي عشر' , 'الجزء الثاني عشر' ,'الجزء الثالث عشر' , 'الجزء الرابع عشر' ,
    'الجزء الخامس عشر' , 'الجزء السادس عشر' , 'الجزء السابع عشر', 'الجزء الثامن عشر' ,'الجزء التاسع عشر' ,'الجزء العشرون' , 'الجزء الحادي والعشرون' ,'الجزء الثاني والعشرون' , 'الجزء الثالث والعشرون' , 'الجزء الرابع والعشرون' ,
    'الجزء الخامس والعشرون' , 'الجزء السادس والعشرون' , 'الجزء السابع والعشرون' , 'الجزء الثامن والعشرون' , 'الجزء الثاسع والعشرون', 'الجزء الثلاثون'];

static final List<int> AhadithNumber=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44];
}


